zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon_sleep/main.c
}
#endif  /* (MAC_BEACON_NOTIFY_INDICATION == 1) */


#if ((MAC_ORPHAN_INDICATION_RESPONSE == 1) || (MAC_ASSOCIATION_INDICATION_RESPONSE == 1))
void usr_mlme_comm_status_ind(wpan_addr_spec_t *SrcAddrSpec,
                              wpan_addr_spec_t *DstAddrSpec,
                              uint8_t status)
{
    if (status == MAC_SUCCESS)
    {
        /*
         * Now the association of the device has been successful and its
         * information, like address, could  be stored.
         * But for the sake of simple handling it has been done
         * during assignment of the short address within the function
         * assign_new_short_addr()
         */
    }

    /* Keep compiler happy. */
    SrcAddrSpec = SrcAddrSpec;
    DstAddrSpec = DstAddrSpec;
}
#endif  /* ((MAC_ORPHAN_INDICATION_RESPONSE == 1) || (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)) */


#if (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)
void usr_mlme_disassociate_conf(uint8_t status,
                                wpan_addr_spec_t *DeviceAddrSpec)
{
	
}
#endif /* (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)*/


#if (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)
void usr_mlme_disassociate_ind(uint64_t DeviceAddress,
                               uint8_t DisassociateReason)
{
	
}
#endif  /* (MAC_DISASSOCIATION_BASIC_SUPPORT == 1) */


#if (MAC_GET_SUPPORT == 1)
void usr_mlme_get_conf(uint8_t status,
                       uint8_t PIBAttribute,
                       void *PIBAttributeValue)
{
	if((status == MAC_SUCCESS) && (PIBAttribute == phyCurrentPage))
	{
		current_channel_page = *(uint8_t *)PIBAttributeValue;
		wpan_mlme_get_req(phyChannelsSupported);
	}
	else if((status == MAC_SUCCESS) && (PIBAttribute == phyChannelsSupported))
	{
		uint8_t index;
		
		channels_supported = *(uint32_t *)PIBAttributeValue;
		
		for(index = 0; index < 32; index++)
		{
			if(channels_supported & (1 << index))
			{
				current_channel = index + CHANNEL_OFFSET;
				break;
			}
		}
        /*
         * Initiate an active scan over all channels to determine
         * which channel is used by the coordinator.
         * Use: bool wpan_mlme_scan_req(uint8_t ScanType,
         *                              uint32_t ScanChannels,
         *                              uint8_t ScanDuration,
         *                              uint8_t ChannelPage);
         *
         * This request leads to a scan confirm message -> usr_mlme_scan_conf
         * Scan for about 50 ms on each channel -> ScanDuration = 1
         * Scan for about 1/2 second on each channel -> ScanDuration = 5
         * Scan for about 1 second on each channel -> ScanDuration = 6
         */
        wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
                           SCAN_CHANNEL,
                           SCAN_DURATION,
                           current_channel_page);

        // Indicate network scanning by a LED flashing
        sw_timer_start(TIMER_LED_OFF,
                        500000,
                        SW_TIMEOUT_RELATIVE,
                        (FUNC_PTR)network_scan_indication_cb,
                        NULL);
	}
}
#endif  /* (MAC_GET_SUPPORT == 1) */


#if (MAC_ORPHAN_INDICATION_RESPONSE == 1)
void usr_mlme_orphan_ind(uint64_t OrphanAddress)
{
	
}
#endif  /* (MAC_ORPHAN_INDICATION_RESPONSE == 1) */


#if (MAC_INDIRECT_DATA_BASIC == 1)
void usr_mlme_poll_conf(uint8_t status)
{
	
}
#endif  /* (MAC_INDIRECT_DATA_BASIC == 1) */


void usr_mlme_reset_conf(uint8_t status)
{
    if (status == MAC_SUCCESS)
    {
		wpan_mlme_get_req(phyCurrentPage);
    }
    else
    {
        // something went wrong; restart
        wpan_mlme_reset_req(true);
    }
}


#if (MAC_RX_ENABLE_SUPPORT == 1)
void usr_mlme_rx_enable_conf(uint8_t status)
{
	
}
#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */


#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      || \
     (MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
     (MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
     (MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))
void usr_mlme_scan_conf(uint8_t status,
                        uint8_t ScanType,
                        uint8_t ChannelPage,
                        uint32_t UnscannedChannels,
                        uint8_t ResultListSize,
                        void *ResultList)
{
    number_of_scans++;

    if (status == MAC_SUCCESS)
    {
        wpan_pandescriptor_t *coordinator;
        uint8_t i;

        /*
         * Analyze the ResultList.
         * Assume that the first entry of the result list is our coodinator.
         */
        coordinator = (wpan_pandescriptor_t *)ResultList;
        for (i = 0; i < ResultListSize; i++)
        {
            /*
             * Check if the PAN descriptor belongs to our coordinator.
             * Check if coordinator allows association.
             */
            if ((coordinator->LogicalChannel == current_channel) &&
                (coordinator->ChannelPage == current_channel_page) &&
                (coordinator->CoordAddrSpec.PANId == DEFAULT_PAN_ID) &&
                ((coordinator->SuperframeSpec & ((uint16_t)1 << ASSOC_PERMIT_BIT_POS)) == ((uint16_t)1 << ASSOC_PERMIT_BIT_POS))
               )
            {
                // Store the coordinator's address
                if (coordinator->CoordAddrSpec.AddrMode == WPAN_ADDRMODE_SHORT)
                {
                    ADDR_COPY_DST_SRC_16(coord_addr.short_addr, coordinator->CoordAddrSpec.Addr.short_address);
                }
                else if (coordinator->CoordAddrSpec.AddrMode == WPAN_ADDRMODE_LONG)
                {
                    ADDR_COPY_DST_SRC_64(coord_addr.ieee_addr, coordinator->CoordAddrSpec.Addr.long_address);
                }
                else
                {
                    // Something went wrong; restart
                    wpan_mlme_reset_req(true);
                    return;
                }

                /*
                 * Associate to our coordinator
                 * Use: bool wpan_mlme_associate_req(uint8_t LogicalChannel,
                 *                                   uint8_t ChannelPage,
                 *                                   wpan_addr_spec_t *CoordAddrSpec,
                 *                                   uint8_t CapabilityInformation);
                 * This request will cause a mlme associate confirm message ->
                 * usr_mlme_associate_conf
                 */
                wpan_mlme_associate_req(coordinator->LogicalChannel,
                                        coordinator->ChannelPage,
                                        &(coordinator->CoordAddrSpec),
                                        WPAN_CAP_ALLOCADDRESS);
                return;
            }

