zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon_sleep/main.c
            // Get the next PAN descriptor
            coordinator++;
        }

        /*
         * If here, the result list does not contain our expected coordinator.
         * Let's scan again.
         */
        if (number_of_scans < MAX_NUMBER_OF_SCANS)
        {
            wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
                               SCAN_CHANNEL,
                               SCAN_DURATION,
                               current_channel_page);
        }
        else
        {
            // No network could be found; therefore start new network.
            /*
             * Set the short address of this node.
             * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
             *                             void *PIBAttributeValue);
             *
             * This request leads to a set confirm message -> usr_mlme_set_conf
             */
            uint8_t short_addr[2];

            short_addr[0] = (uint8_t)COORD_SHORT_ADDR;          // low byte
            short_addr[1] = (uint8_t)(COORD_SHORT_ADDR >> 8);   // high byte
            wpan_mlme_set_req(macShortAddress, short_addr);
        }
    }
    else if (status == MAC_NO_BEACON)
    {
        /*
         * No beacon is received; no coordiantor is located.
         * Scan again, but used longer scan duration.
         */
        if (number_of_scans < MAX_NUMBER_OF_SCANS)
        {
            wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
                               SCAN_CHANNEL,
                               SCAN_DURATION,
                               current_channel_page);
        }
        else
        {
            // No network could be found; therefore start new network.
            /*
             * Set the short address of this node.
             * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
             *                             void *PIBAttributeValue);
             *
             * This request leads to a set confirm message -> usr_mlme_set_conf
             */
            uint8_t short_addr[2];

            short_addr[0] = (uint8_t)COORD_SHORT_ADDR;          // low byte
            short_addr[1] = (uint8_t)(COORD_SHORT_ADDR >> 8);   // high byte
            wpan_mlme_set_req(macShortAddress, short_addr);
        }
    }
    else
    {
        // Something went wrong; restart
        wpan_mlme_reset_req(true);
    }

    /* Keep compiler happy. */
    ScanType = ScanType;
    UnscannedChannels = UnscannedChannels;
    ChannelPage = ChannelPage;
}
#endif


void usr_mlme_set_conf(uint8_t status,
                       uint8_t PIBAttribute)
{
    if ((status == MAC_SUCCESS) && (PIBAttribute == macShortAddress))
    {
        /*
         * Allow other devices to associate to this coordinator.
         * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
         *                             void *PIBAttributeValue);
         *
         * This request leads to a set confirm message -> usr_mlme_set_conf
         */
        uint8_t association_permit = true;

        wpan_mlme_set_req(macAssociationPermit, &association_permit);
    }
    else if ((status == MAC_SUCCESS) && (PIBAttribute == macAssociationPermit))
    {
        /*
         * Set RX on when idle to enable the receiver as default.
         * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
         *                             void *PIBAttributeValue);
         *
         * This request leads to a set confirm message -> usr_mlme_set_conf
         */
        bool rx_on_when_idle = true;

        wpan_mlme_set_req(macRxOnWhenIdle, &rx_on_when_idle);
    }
    else if ((status == MAC_SUCCESS) && (PIBAttribute == macRxOnWhenIdle))
    {
        /*
         * Start a nonbeacon-enabled network
         * Use: bool wpan_mlme_start_req(uint16_t PANId,
         *                               uint8_t LogicalChannel,
         *                               uint8_t ChannelPage,
         *                               uint8_t BeaconOrder,
         *                               uint8_t SuperframeOrder,
         *                               bool PANCoordinator,
         *                               bool BatteryLifeExtension,
         *                               bool CoordRealignment)
         *
         * This request leads to a start confirm message -> usr_mlme_start_conf
         */
        wpan_mlme_start_req(DEFAULT_PAN_ID,
                            current_channel,
                            current_channel_page,
                            15, 15,
                            true, false, false);
    }
    else
    {
        // something went wrong; restart
        wpan_mlme_reset_req(true);
    }
}


#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
    if (status == MAC_SUCCESS)
    {
        node_status = PC_RUNNING;

        /*
         * Network is established.
         * Waiting for association indication from a device.
         * -> usr_mlme_associate_ind
         */
        // Stop timer used for search indication
        sw_timer_stop(TIMER_LED_OFF);
        LED_On(LED_NWK_SETUP);
    }
    else
    {
        // something went wrong; restart
        wpan_mlme_reset_req(true);
    }
}
#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */


void usr_mlme_sync_loss_ind(uint8_t LossReason,
                            uint16_t PANId,
                            uint8_t LogicalChannel,
                            uint8_t ChannelPage)
{
	
}


static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16)
{
    uint8_t i;

    // Check if device has been associated before
    for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++)
    {
        if (device_list[i].short_addr == 0x0000)
        {
            // If the short address is 0x0000, it has not been used before
            continue;
        }
        if (device_list[i].ieee_addr == addr64)
        {
            // Assign the previously assigned short address again
            *addr16 = device_list[i].short_addr;
            return true;
        }
    }

    for (i = 0; i < MAX_NUMBER_OF_DEVICES; i++)
    {
        if (device_list[i].short_addr == 0x0000)
        {
            *addr16 = CPU_ENDIAN_TO_LE16(i + 0x0001);
            device_list[i].short_addr = CPU_ENDIAN_TO_LE16(i + 0x0001); // get next short address
            device_list[i].ieee_addr = addr64;      // store extended address
            return true;
        }
    }

    // If we are here, no short address could be assigned.
    return false;
}

static void app_alert(void)
{
    while (1)
    {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

