zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon_sleep/main.c
		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

static void network_scan_indication_cb(void *parameter)
{
    LED_Toggle(LED_NWK_SETUP);

    // Re-start led timer again
    sw_timer_start(TIMER_LED_OFF,
                    500000,
                    SW_TIMEOUT_RELATIVE,
                    (FUNC_PTR)network_scan_indication_cb,
                    NULL);

    parameter = parameter; /* Keep compiler happy. */
}

static void data_exchange_led_off_cb(void *parameter)
{
    LED_Off(LED_DATA);

    parameter = parameter;  /* Keep compiler happy. */
}


static void app_task(void)
{
    switch (node_status)
    {
        case IDLE:
        {
			if (timer_flag)
			{
				timer_flag = false;
				LED_On(LED_DATA);

				node_status = TRANSMITTING;

				/*
				 * Send some data and put MCU to sleep again.
				 * Use: bool wpan_mcps_data_req(uint8_t SrcAddrMode,
				 *                              wpan_addr_spec_t *DstAddrSpec,
				 *                              uint8_t msduLength,
				 *                              uint8_t *msdu,
				 *                              uint8_t msduHandle,
				 *                              uint8_t TxOptions);
				 *
				 * This request will cause a mcps data confirm message ->
				 * usr_mcps_data_conf
				 */

				uint8_t src_addr_mode;
				wpan_addr_spec_t dst_addr;
				uint8_t payload;
				static uint8_t msduHandle = 0;

				src_addr_mode = WPAN_ADDRMODE_SHORT;

				dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
				dst_addr.PANId = DEFAULT_PAN_ID;
				ADDR_COPY_DST_SRC_16(dst_addr.Addr.short_address, coord_addr.short_addr);

				payload = (uint8_t)rand();  // any dummy data
				msduHandle++;               // increment handle
				wpan_mcps_data_req(src_addr_mode,
								   &dst_addr,
								   1,
								   &payload,
								   msduHandle,
								   WPAN_TXOPT_ACK);
			}
			else
			{
				/*
				 * The MCU will wake up again, once the buttons is pressed
				 * on the board.Since no button pressed now set system to sleep.
				 * Set MCU to sleep if stack is not busy
				 */
				if (mac_ready_to_sleep() && in_sleep_mode == false)
				{
					in_sleep_mode = true;
					sleepmgr_init();
					sleepmgr_lock_mode(mode);
					sleepmgr_enter_sleep();
				}
				/* MCU is awake again */
			}
        }
        break;

        default:
            /* Do nothing. */
            break;
    }
}

static void awake_timer_cb(void *parameter)
{
	timer_flag = true;
	in_sleep_mode = false;
	
	sw_timer_start(TIMER_LED_OFF,
				   DATA_TX_PERIOD,
				   SW_TIMEOUT_RELATIVE,
				   (FUNC_PTR)awake_timer_cb,
				   NULL);
}